app/controllers/about_controller.rb

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
SELECT * FROM "posts" WHERE ("posts"."author_id" = 1 AND "posts"."visible" IS NULL) LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "posts" WHERE ("posts".author_id = 1)
---
  def show
    @author = Author.find(params[:id])
    @visible_posts = Post.paginate(
                      :page => params[:page],
                      :conditions => { :visible => true, :author_id => @author.id })