app/controllers/authors_controller.rb

SELECT * FROM "authors"
---
  def index
    authorize
    @authors = Author.all

SELECT * FROM "authors" WHERE ("authors"."id" = 1) LIMIT 1
---
  def show
    authorize
    @author = Author.find(params[:id])

SELECT * FROM "authors" WHERE ("authors"."id" = 1) LIMIT 1
---
  def edit
    @author = Author.find(params[:id])

INSERT INTO "authors" ("name", "updated_at", "description", "image", "created_at") VALUES('Carlos López', '2009-08-16 19:58:02', 'Desarrollador de blewblew', 'noimage.jpg', '2009-08-16 19:58:02')
---
  def create
    authorize
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save

SELECT * FROM "authors" WHERE ("authors"."id" = 1) LIMIT 1
UPDATE "authors" SET "image_content_type" = 'image/jpeg', "image_file_name" = 'gotosleep.jpg', "image_file_size" = 92100, "image_updated_at" = '2009-08-21 18:37:22', "updated_at" = '2009-08-21 18:37:22' WHERE "id" = 1
---
  def update
    @author = Author.find(params[:id])
    authorize(@author.id)
    respond_to do |format|
      if @author.update_attributes(params[:author])