app/controllers/backgrounds_controller.rb

SELECT * FROM "backgrounds" ORDER BY id DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "backgrounds"
---
  def index
    @backgrounds = Background.paginate(:page => params[:page], :order=>"id DESC")

SELECT * FROM "backgrounds" WHERE ("backgrounds"."id" = 1)
---
  def show
    @background = Background.find(params[:id])

SELECT * FROM "backgrounds" WHERE ("backgrounds"."id" = 1)
---
  def edit
    @background = Background.find(params[:id])

INSERT INTO "backgrounds" ("created_at", "image_file_name", "title", "image_file_size", "updated_at", "url", "image_content_type", "content", "author_id", "image_updated_at") VALUES('2009-08-29 16:24:57', 'itesmAzulRGB.gif.jpeg', 'Nuevo background', 95192, '2009-08-29 16:24:57', NULL, 'image/jpeg', 'Lalalalal', 1, '2009-08-29 16:24:57')
---
  def create
    @background = Background.new(params[:background])
    @background.author_id = session[:author].id
    respond_to do |format|
      if @background.save

SELECT * FROM "backgrounds" WHERE ("backgrounds"."id" = 6)
UPDATE "backgrounds" SET "updated_at" = '2009-09-01 17:17:39', "image_file_size" = 6655, "image_file_name" = 'f088f0a4837a07cbb171671be6e4cdd7.jpg', "image_updated_at" = '2009-09-01 17:17:39' WHERE "id" = 14
---
  def update
    @background = Background.find(params[:id])
    authorize(@background.author.id)
    respond_to do |format|
      if @background.update_attributes(params[:background])

SELECT * FROM "backgrounds" WHERE ("backgrounds"."id" = 2)
DELETE FROM "backgrounds" WHERE "id" = 2
---
  def destroy
    @background = Background.find(params[:id])
    authorize(@background.author.id)
    @background.destroy