app/controllers/comments_controller.rb

  def index
    @comments = Array.new
    author = Author.find(session[:author])
    author.posts.each do |post|
---
SELECT * FROM "authors" WHERE ("authors"."id" = 2)
SELECT * FROM "posts" WHERE ("posts".author_id = 1)

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)

  def create
    @comment = Comment.new(
                :name => params[:name],
                :email => params[:email],
                :content => params[:content],
                :post_id => params[:post_id],
                :website => params[:website]
              )

    if verify_recaptcha && @comment.save
---
INSERT INTO "comments" ("name", "updated_at", "post_id", "website", "content", "email", "created_at") VALUES('Carlos', '2009-08-22 19:06:52', 22, NULL, 'Esto es una prueba de comment, es genial que blewblew haya regresado ˆˆ :)', 'carlos@blewblew.com', '2009-08-22 19:06:52')

  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
UPDATE "comments" SET "website" = 'http://www.blewblew.com', "updated_at" = '2009-08-22 19:14:30' WHERE "id" = 26

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 8)
DELETE FROM "comments" WHERE "id" = 8