app/controllers/feedback_controller.rb

INSERT INTO "feedbacks" ("name", "created_at", "title", "updated_at", "content", "email") VALUES('Carlos López', '2009-08-31 04:10:09', 'Feedback!!', '2009-08-31 04:10:09', 'drhdsfhdsfh', 'carlos@blewblew.com')
---
  def create
    @feedback = Feedback.new(params[:feedback])
    if verify_recaptcha && @feedback.save