app/controllers/feedbacks_controller.rb

SELECT * FROM "feedbacks"
---
  def index
    authorize
    @feedbacks = Feedback.all

SELECT * FROM "feedbacks" WHERE ("feedbacks"."id" = 1)
---
  def show
    authorize
    @feedback = Feedback.find(params[:id])

INSERT INTO "feedbacks" ("name", "created_at", "title", "updated_at", "content", "email") VALUES('Carlos López', '2009-08-31 04:04:47', 'Feedback!!', '2009-08-31 04:04:47', 'Blewblew es la ondaaaa ;)', 'carlos@blewblew.com')
---
  def create
    authorize
    @feedback = Feedback.new(params[:feedback])

    respond_to do |format|
      if @feedback.save