app/controllers/home_controller.rb

SELECT * FROM "posts" WHERE ("posts"."is_headline" IS NULL AND "posts"."visible" = 't') ORDER BY id DESC LIMIT 6
---
  def index
    @headlines = Post.find(:all, :conditions => { :is_headline => true, :visible => true},
                            :limit => 3, :order => "id DESC")