app/controllers/posts_controller.rb

  def index
    if params[:year]
      @year = params[:year]
    else
      @year = Time.now.strftime('%Y')
    end

    if params[:month]
      if(params[:month].to_i < 10)
        params[:month] = "0"+params[:month].to_i.to_s
      end
      @month = params[:month]
    else
      @month = Time.now.strftime('%m')
    end
    @month_date = Date.new(@year.to_i, @month.to_i, 1)
    @posts = Post.paginate :page => params[:page],
             :conditions => { :created_at => @year+'-'+@month+'-01'..@year+'-'+@month+'-31',
                              :visible => true },
             :order=>'id DESC'
---
SELECT * FROM "posts" WHERE ("posts"."created_at" BETWEEN '2009-09-01' AND '2009-09-31' AND "posts"."visible" = 't') ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "posts"

  def show
    require "digest"
    @post = Post.find(params[:id])
    if(@post.visible != true && (!session[:author] || session[:author].id != @post.author_id))
      flash[:error] = "El post solicitado es invisible"
      redirect_to "/posts"
    end
    @comments = @post.comments.paginate(:page => params[:page])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "authors" WHERE ("authors"."id" = 1)
SELECT * FROM "comments" WHERE ("comments".post_id = 22) LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "comments" WHERE ("comments".post_id = 3)

  def create
    authorize
    params[:post][:author_id] = session[:author].id
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("image_file_size", "updated_at", "title", "is_headline", "image_content_type", "content", "author_id", "image_updated_at", "created_at", "image_file_name") VALUES(130878, '2009-08-17 21:12:35', 'Post de prueba', 't', 'image/jpeg', '<P>The Beatles were a rock and pop group formed in Liverpool, England in 1960 who became one of the most commercially successful and critically acclaimed bands in the history of popular music.[1] During their years of stardom, the band consisted of John Lennon (rhythm guitar, vocals), Paul McCartney (bass guitar, vocals, piano), George Harrison (lead guitar, vocals) and Ringo Starr (drums, vocals), and were managed by Brian Epstein until his death in 1967. Although their initial musical style was rooted in 1950s rock and roll and skiffle, the group worked with different musical genres, ranging from Tin Pan Alley to psychedelic rock. Their clothes, style and statements made them trend-setters, while their growing social awareness saw their influence extend into the social and cultural revolutions of the 1960s.</P>

  def update
    @post = Post.find(params[:id])
    authorize(@post.author.id)
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
UPDATE "posts" SET "visible" = 't', "updated_at" = '2009-09-01 17:10:35', "content" = '<p>The Beatles were a rock and pop group formed in Liverpool, England in 1960 who became one of the most commercially successful and critically acclaimed bands in the history of popular music.[1] During their years of stardom, the band consisted of John Lennon (rhythm guitar, vocals), Paul McCartney (bass guitar, vocals, piano), George Harrison (lead guitar, vocals) and Ringo Starr (drums, vocals), and were managed by Brian Epstein until his death in 1967. Although their initial musical style was rooted in 1950s rock and roll and skiffle, the group worked with different musical genres, ranging from Tin Pan Alley to psychedelic rock. Their clothes, style and statements made them trend-setters, while their growing social awareness saw their influence extend into the social and cultural revolutions of the 1960s.</p>

  def destroy
    @post = Post.find(params[:id])
    @post.comments.each do |comment|
      comment.destroy
    end
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 23)
DELETE FROM "posts" WHERE "id" = 23

  def unhide
    @post = Post.find(params[:id])
    authorize(@post.author.id)
    @post.visible = true
    @post.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 16)
UPDATE "posts" SET "visible" = 't', "updated_at" = '2009-09-01 17:10:16' WHERE "id" = 16